import numpy as np

#numpy.empty创建一个指定形状（shape）、数据类型（dtype）且未初始化的数组
x1 = np.empty([3,2], dtype = int)
print(x1) #数组元素为随机值，因为它们未初始化
'''
[[         0 1072168960]
 [         0 1072168960]
 [         0          0]]
'''
print('-----------------------------------------------------')
#numpy.zeros创建指定大小的数组，数组元素以0来填充
# 默认为浮点数
x2 = np.zeros(5)
print('x2数组:')
print(x2)
print('-----------------------------------------------------')
# 设置类型为整数
x3 = np.zeros((5,), dtype=np.int)
print('x3数组:')
print(x3)
print('-----------------------------------------------------')
# 自定义类型
x4 = np.zeros((2, 2), dtype=[('x', 'i4'), ('y', 'i4')])
print('x4数组:')
print(x4)
'''
x2数组:
[0. 0. 0. 0. 0.]
x3数组:
[0 0 0 0 0]
x4数组:
[[(0, 0) (0, 0)]
 [(0, 0) (0, 0)]]
'''
print('-----------------------------------------------------')
#numpy.ones创建指定形状的数组,数组元素以1来填充
# 默认为浮点数
x5 = np.ones(5)
print('x5数组:')
print(x5)
print('-----------------------------------------------------')
# 自定义类型
x6 = np.ones([2,2], dtype=int)
print('x6数组:')
print(x6)
'''
x5数组:
[1. 1. 1. 1. 1.]
x6数组:
[[1 1]
 [1 1]]
'''