import numpy as np

#arange函数创建数值范围并返回 ndarray 对象
x1 = np.arange(5)
print('x1数组:')
print(x1)
'''
x1数组:
[0 1 2 3 4]
'''
print('-----------------------------------------------------')
#设置dtype
x2 = np.arange(5, dtype=float)
print('x2数组:')
print (x2)
'''
x2数组:
[0. 1. 2. 3. 4.]
'''
print('-----------------------------------------------------')
#设置起始值、终止值和步长
x3 = np.arange(10,20,4)
print('x3数组:')
print(x3)
'''
x3数组:
[10 14 18]
'''
print('-----------------------------------------------------')
#numpy.linspace函数创建一个一维数组，数组是一个等差数列
x4 = np.linspace(1,10,3)
print('x4数组:')
print(x4)
'''
x4数组:
[1. 5.5 10.]
'''
print('-----------------------------------------------------')
#设置元素全部是1的等差数列
x5 = np.linspace(1,1,5)
print('x5数组:')
print(x5)
'''
x5数组:
[1. 1. 1. 1. 1.]
'''
print('-----------------------------------------------------')
#endpoint设为false不包含终止值
x6 = np.linspace(10,20,5,endpoint=False)
x7 = np.linspace(10,20,5)
print('x6数组:')
print(x6)
print('x7数组:')
print(x7)
'''
x7数组:
[10. 12.5 15. 17.5 20.]
'''
print('-----------------------------------------------------')
#设置显示间距
x8 = np.linspace(1,10,10,retstep=True)
print('x8数组:')
print(x8)
'''
x8数组:
(array([ 1.,  2.,  3.,  4.,  5.,  6.,  7.,  8.,  9., 10.]), 1.0)
'''
print('-----------------------------------------------------')
#numpy.logspace创建等比数列
x9 = np.logspace(0,9,10,base=2)
print('x9数组:')
print(x9)
'''
x9数组:
[1. 2. 4. 8. 16. 32. 64. 128. 256. 512.]
'''