import numpy as np

a1 = np.array([1,2,3,4])
b1 = np.array([10,20,30,40])
c1 = a1*b1
print('广播c1数组:')
print(c1)
'''
广播c数组:
[ 10 40 90 160]
'''
print('-----------------------------------------------------')
#当运算中的 2个数组的形状不同时，numpy将自动触发广播机制
a2 = np.array([[ 0, 0, 0],
              [10,10,10],
              [20,20,20],
              [30,30,30]])
b2 = np.array([1,2,3])
c2 = a2*b2
print('广播c2数组:')
print(c2)
'''
广播c2数组:
[[ 0  0  0]
 [10 20 30]
 [20 40 60]
 [30 60 90]]
'''
print('-----------------------------------------------------')
#tile()函数将原矩阵横向、纵向地复制
b3 = np.tile(b2,(4,1))  # 重复b的各个维度
print('重复4次b2数组:')
print(b3)
c3 = a2*b3
print('广播c3数组:')
print(c3)
'''
重复4次b2数组:
[[1 2 3]
 [1 2 3]
 [1 2 3]
 [1 2 3]]
广播c3数组:
[[ 0  0  0]
 [10 20 30]
 [20 40 60]
 [30 60 90]]
'''